import 'package:qawafi_app/core/enums/search_keys.dart';

class Constants {
  static const List<String> topics = [
    'Technology',
    'Business',
    'Programming',
    'Entertainment',
  ];

  static const noConnectionErrorMessage = 'Not connected to a network!';

  static const login = 'تسجيل الدخول';

  static const Map<String, String> arabicAlphabet = {
    'أ': 'أ',
    'ب': 'ب',
    'ت': 'ت',
    'ث': 'ث',
    'ج': 'ج',
    'ح': 'ح',
    'خ': 'خ',
    'د': 'د',
    'ذ': 'ذ',
    'ر': 'ر',
    'ز': 'ز',
    'س': 'س',
    'ش': 'ش',
    'ص': 'ص',
    'ض': 'ض',
    'ط': 'ط',
    'ظ': 'ظ',
    'ع': 'ع',
    'غ': 'غ',
    'ف': 'ف',
    'ق': 'ق',
    'ك': 'ك',
    'ل': 'ل',
    'م': 'م',
    'ن': 'ن',
    'ه': 'ه',
    'و': 'و',
    'ي': 'ي',
  };

  static const Map<SearchKeys, String> searchByMap = {
    SearchKeys.name: 'الاسم',
    SearchKeys.beginning: 'كلمات البداية',
    SearchKeys.keyWords: 'الكلمات المفتاحية',
    SearchKeys.purpose: 'الغرض',
    SearchKeys.melody: 'اللحن',
  };

  static const String privacyPolicyText = '''
  سياسة الخصوصية  “منصة قوافي”
 

    تلتزم منصة قوافي بحماية خصوصية مستخدميها وضمان سرية معلوماتهم. نؤكد أننا لا نقوم بجمع أي بيانات شخصية مثل الاسم أو البريد الإلكتروني أو العنوان أو رقم الهاتف من       المستخدمين عند استخدام تطبيقنا..

مشاركة المعلومات:
نحن لا نشارك أي معلومات شخصية مع أطراف ثالثة، حيث أننا لا نقوم بجمعها من الأساس. ومع ذلك، قد نستخدم المعلومات غير الشخصية التي يتم جمعها عبر ملفات تعريف الارتباط لتحسين خدماتنا.
الأمان وحماية البيانات:
نلتزم بتطبيق إجراءات أمنية مناسبة لحماية المعلومات غير الشخصية التي قد يتم جمعها عبر ملفات تعريف الارتباط من الوصول غير المصرح به أو التغيير.

روابط خارجية:
قد يحتوي موقعنا على روابط لمواقع خارجية. لسنا مسؤولين عن سياسات الخصوصية أو محتوى هذه المواقع، وننصح المستخدمين بقراءة سياسات الخصوصية الخاصة بكل موقع يزورونه.
التعديلات:
نحتفظ بالحق في تعديل هذه السياسة في أي وقت، وسننشر أي تغييرات على هذه الصفحة. يُنصح المستخدمون بمراجعة السياسة بانتظام للبقاء على اطلاع على أي تحديثات.
 
سياسة الاستخدام “منصة قوافي”
 

عند استخدامك لتطبيق “منصة قوافي”، فإنك توافق على الشروط التالية الخاصة باستخدام المحتوى والخدمات المتاحة في التطبيق:

ملكية المحتوى وحقوق الاستخدام:
كل المحتوى الموجود في التطبيق، بما في ذلك النصوص، والصور، والصوتيات، والفيديوهات، هو ملك لمنصة قوافي. نحن نحتفظ بجميع حقوق الملكية الفكرية المتعلقة بهذا المحتوى، ويُمنع منعاً باتاً نسخ أو إعادة إنتاج أو نشر أو توزيع أي جزء من المحتوى لأغراض تجارية دون إذن كتابي مسبق من قِبلنا.
الاستخدام الشخصي فقط:
يُسمح للمستخدمين باستخدام المحتوى والخدمات المتاحة على التطبيق لأغراض شخصية فقط. يُحظر استخدام التطبيق أو محتواه لأي أغراض تجارية أو استغلاله بطريقة تتعارض مع حقوق الملكية الفكرية الخاصة بنا.
التعديلات أو الإنهاء:
نحتفظ بالحق في تعديل أو تحديث أو إيقاف التطبيق أو أي جزء من المحتوى أو الخدمات في أي وقت ودون إشعار مسبق.
التزام المستخدم:
يُوافق المستخدم على عدم محاولة تعديل أو اختراق التطبيق أو الوصول إلى المحتوى بشكل غير مشروع. وفي حال مخالفة أي من هذه الشروط، تحتفظ منصة قوافي بالحق في اتخاذ الإجراءات القانونية اللازمة لحماية حقوقها.
       لمزيد من المعلومات أو الاستفسارات حول سياسة الخصوصية أو سياسة الاستخدام، يُرجى التواصل معنا عبر البريد الإلكتروني.
  ''';

  static const Map<int, String> packages = {
    1: "الباقة الأسبوعية",
    2: "الباقة الشهرية",
    3: "باقة الثلاثةأشهر",
    4: "الباقة الرابعة",
    5: "الباقة الخامسة",
    6: "الباقة السادسة",
    7: "الباقة السابعة",
    8: "الباقة الثانية",
    9: "الباقة الأولى",
    10: "الباقة الثانية",
    11: "الباقة الأولى",
    12: "الباقة الثانية",
    13: "الباقة الأولى",
    14: "الباقة الثانية",
    15: "الباقة الأولى",
    16: "الباقة الثانية",
    17: "الباقة الأولى",
    18: "الباقة الثانية",
    19: "الباقة الأولى",
    20: "الباقة الثانية",
  };

  static const libyanTitlesItemHieght = 50;
}
